Tekla Open API Reference for Tekla Structures 2025
Operation.ExplodeBentPlate Method
 Deletes bentPlate and inserts ContourPlates instances equivalent to the ones used to create bentPlate. The ContourPlate created from the main polygon has the same identifier as bentPlate.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool ExplodeBentPlate(
	BentPlate bentPlate
)
Public Shared Function ExplodeBentPlate (
	bentPlate As BentPlate
) As Boolean
Parameters
bentPlate
Type: Tekla.Structures.Model.BentPlate
the BentPlate instance to explode.
Return Value
Type: Boolean
True on success.
Exceptions
Exception | Condition
ArgumentException | Thrown when bentPlate is invalid.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace